{"basics":{"name":"Iván de Paz Centeno","label":"PhD in Artificial Intelligence · Founder of RelevAI & AI Consultant · Former Chief AI Officer","image":"","url":"https://ipazc.com/","summary":"Iván de Paz Centeno founder of RelevAI S.L. is a PhD-level Artificial Intelligence specialist with a strong background in applied AI, Large Language Models, and AI system architecture. He has led and implemented AI solutions across industry and research, ranging from energy analytics and predictive maintenance to NLP, RAG systems, and agent-based LLM workflows. Iván combines deep technical expertise with strategic vision, delivering production-ready AI systems for real-world impact.","summary short":"PhD in Artificial Intelligence, Founder of RelevAI & AI Consultant specialised in LLMs, RAG systems, and applied AI architectures.","location":{"city":"León","region":"Castilla y León","countryCode":"ES"},"profiles":[{"network":"GitHub","username":"ipazc","url":"https://github.com/ipazc"},{"network":"Stack Overflow","username":"5213005","url":"https://stackoverflow.com/users/5213005/ivan-de-paz-centeno"},{"network":"LinkedIn","username":"ivan-de-paz-centeno","url":"https://www.linkedin.com/in/ivan-de-paz-centeno/"},{"network":"Google scholar","username":"MsboynQAAAAJ","url":"https://scholar.google.com/citations?user=MsboynQAAAAJ&hl=es"},{"network":"ORCID","username":"0000-0002-9004-4685","url":"https://orcid.org/0000-0002-9004-4685"}]},"work":[{"name":"RelevAI, S.L.","position":"Founder & CEO / AI Consultant / Technology Implementer","url":"https://relev.ai","startDate":"2025-05-01","endDate":"","summary":"Design, development, and deployment of applied artificial intelligence solutions with a strong focus on Natural Language Processing and Large Language Models.","highlights":["Designed and deployed LLM-based solutions including retrieval-augmented generation (RAG) systems and domain-specific assistants.","Evaluated, fine-tuned, and integrated large language models into production-ready systems.","Developed bespoke AI-powered software solutions addressing concrete business and operational needs.","Designed and deployed scalable AI system architectures for experimentation, testing, and production workloads.","Provided AI consulting services translating business needs into robust, maintainable technical solutions."]},{"name":"Smarkia Energy S.L.","position":"Chief Artificial Intelligence Officer (CAIO)","url":"https://www.smarkia.com","startDate":"2024-10-01","endDate":"2025-04-30","summary":"Led enterprise-wide AI strategy and implementation, focusing on LLM-driven automation, decision support, and AI-enabled SaaS evolution.","highlights":["Defined and executed the corporate AI roadmap, delivering multiple AI initiatives focused on automation and decision support.","Designed and implemented LLM-based automation platforms, reducing manual workflows from weeks to hours.","Co-developed natural language interfaces enabling intelligent interaction with the SaaS platform.","Implemented multi-agent LLM workflows to automate internal processes across departments.","Acted as the company’s AI interface with clients, partners, and external technology providers.","Analysed AI regulations and contributed to legal and compliance alignment of deployed solutions."]},{"name":"Smarkia Energy S.L.","position":"AI Research Team Lead","url":"https://www.smarkia.com","startDate":"2023-07-01","endDate":"2024-10-01","summary":"Leadership and execution of applied AI initiatives for energy analytics, forecasting, anomaly detection, and predictive maintenance.","highlights":["Led an AI research team composed of PhD-level researchers, coordinating work with product and development teams.","Analysed data from hundreds of inverters across approximately 900 photovoltaic plants.","Designed and implemented ML and DL models for forecasting and anomaly detection.","Developed AI prototypes for energy consumption and production optimisation.","Ensured integration of research outputs into the company’s SaaS platform."]},{"name":"Smarkia Energy S.L.","position":"Principal Researcher (Industrial PhD)","url":"https://www.smarkia.com","startDate":"2018-07-01","endDate":"2023-07-01","summary":"Industrial PhD focused on AI-based energy optimisation, forecasting, and predictive maintenance.","highlights":["Designed AI-based proof-of-concept solutions for energy management and optimisation.","Developed novel ML and DL techniques for time series forecasting, reconstruction, super-resolution, and anomaly detection.","Processed and analysed large-scale energy datasets exceeding 100,000 time series.","Designed anomaly detection architectures supporting public–private R&D funding acquisition.","Implemented forecasting systems enabling near real-time inference across energy assets.","Participated in the deployment of scalable cloud-based AI solutions."]},{"name":"University of León / INCIBE","position":"Researcher / Technology Implementer","url":"https://www.incibe.es","startDate":"2016-04-01","endDate":"2018-03-01","summary":"Applied research in computer vision and machine learning for cybersecurity and security-related applications.","highlights":["Developed AI techniques for image processing, classification, and regression.","Specialised in face detection, face recognition, and age and gender estimation.","Designed computer vision models suitable for real-world operational environments.","Packaged and deployed AI models as REST APIs for external integration."]}],"education":[{"institution":"University of León","url":"https://www.unileon.es","area":"Artificial Intelligence","studyType":"PhD in Artificial Intelligence (Industrial Engineering and Computer Science)","startDate":"2017-02-01","endDate":"2023-06-01","score":"Cum Laude"},{"institution":"University of León","url":"https://www.unileon.es","area":"Computer Science","studyType":"Master's Degree in Computer Science","startDate":"2015-09-01","endDate":"2017-06-01"},{"institution":"University of León","url":"https://www.unileon.es","area":"Computer Science","studyType":"Bachelor's Degree in Computer Science","startDate":"2010-09-01","endDate":"2015-06-01"}],"skills":[{"name":"Artificial Intelligence","keywords":["Machine Learning","Deep Learning","Large Language Models","Retrieval-Augmented Generation (RAG)","Agent-based architectures"]},{"name":"Natural Language Processing","keywords":["Text representation","Classification","Information extraction","Domain-specific assistants","LLM fine-tuning"]},{"name":"Data & Time Series","keywords":["Time Series Analysis","Forecasting","Anomaly Detection","Predictive Maintenance","Feature Engineering"]},{"name":"Software & MLOps","keywords":["Python","C/C++","AI system architecture","Model deployment","Monitoring and versioning","Research-to-production workflows"]}],"certificates":[{"name":"Convolutional Neural Networks","issuer":"DeepLearning.AI (Coursera)","date":"2018-11"},{"name":"Neural Networks and Deep Learning","issuer":"DeepLearning.AI (Coursera)","date":"2018-05"},{"name":"Improving Deep Neural Networks","issuer":"DeepLearning.AI (Coursera)","date":"2018-05"},{"name":"Structuring Machine Learning Projects","issuer":"DeepLearning.AI (Coursera)","date":"2018-06"}],"publications":[{"releaseDate":"2023","publisher":"Expert Systems with Applications","name":"Imputation of missing measurements in PV production data within constrained environments","summary":""},{"releaseDate":"2023","publisher":"IEEE Access","name":"A Granularity Invariant Method for the Classification of Energy Production Time Series in Photovoltaic Plants","summary":""},{"releaseDate":"2022","publisher":"2022 International Conference on Electrical, Computer and Energy Technologies (ICECET)","name":"Using Super Resolution Perception for Anomaly Detection in Energy Load Profiles","summary":""},{"releaseDate":"2021","publisher":"Energies","name":"M-SRPCNN: A Fully Convolutional Neural Network Approach for Handling Super Resolution Reconstruction on Monthly Energy Consumption Environments","summary":""},{"releaseDate":"2017","publisher":"Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 1, Long Papers","name":"Classifying Illegal Activities on Tor Network Based on Web Textual Contents","summary":""}],"awards":[{"title":"PhD Dissertation with Distinction (Cum Laude)","date":"2023-06","awarder":"University of León","summary":"Awarded Cum Laude distinction for the PhD dissertation, including an industrial mention."},{"title":"Extraordinary End-of-Career Award","date":"2018-03","awarder":"University of León","summary":"Granted for outstanding academic performance in the Master's degree in Computer Science."},{"title":"1st Position – Hack2Progress","date":"2016-11","awarder":"CIC Consulting Informático","summary":"First place at the Hack2Progress 2016 hackathon held in Santander, Spain."},{"title":"2nd Position – HackForGood","date":"2016-02","awarder":"HackForGood","summary":"Second place at the HackForGood 2016 hackathon held in León, Spain."}],"languages":[{"language":"Spanish","fluency":"Native"},{"language":"English","fluency":"C1 (Fluent)"}]}